# Drop Duplicates

### Import Pandas

In [1]:
# import pandas
import pandas as pd
from pathlib import Path
path = Path('C:/Users/alouden01/Documents/python-pandas-for-data-manipulation/starter_files/skill_10_filtering_duplicates/employee.csv')

### Employee data

In [4]:
# read csv and parse the date column
emp = pd.read_csv(path, parse_dates=['start_date'])

### Head

In [5]:
# called the head method to see what were working with
emp.head()

  first_name   last_name  salary start_date    gender  remote         team
0    Haleigh  Calderhead  334473 2020-05-09       NaN    True   management
1    Coretta      McEvon  637457 2020-03-20      Male   False  engineering
2   Clarette     Tarbett  977749 2020-11-22   Agender    True  engineering
3      Jaime  Gianneschi  253523 2020-09-02  Bigender   False    marketing
4      Ediva     Skelton  325185 2020-02-04    Female    True    marketing

In [6]:
len(emp)

1000

In [7]:
# all values must be duplicates to be dropped
len(emp.drop_duplicates())

1000

In [8]:
# keeps the first duplicate instance and drops the rest
len(emp.drop_duplicates(subset=['first_name']))

941

In [22]:
emp.sort_values('first_name', inplace=True)
mask_fn_team = emp.duplicated(subset=['first_name','team'])
# emp[mask_fn_team]
mask_no_dupes = emp.duplicated(subset='first_name', keep=False)
emp[mask_no_dupes]

,first_name,last_name,salary,start_date,gender,remote,team
872,Aaron,Caddens,583629,2020-10-05,Female,True,marketing
619,Aaron,Pohls,188614,2021-01-29,Male,True,marketing
371,Adrianne,Fishbourne,530451,2020-07-04,Polygender,True,marketing
83,Adrianne,Charte,573994,2020-07-13,Male,True,management
142,Aluino,Kubal,413941,2020-07-24,Female,True,management
...,...,...,...,...,...,...,...
989,Wilma,Raittie,382770,2020-10-15,Non-binary,True,marketing
257,Winny,Antonutti,123855,2020-07-07,Non-binary,False,marketing
118,Winny,Hache,260980,2020-05-06,Male,False,management
783,Zita,Follos,891648,2020-10-09,Genderqueer,False,marketing
476,Zita,Bewicke,198218,2020-12-11,Female,True,data analytics

In [34]:
dup_mask = emp['first_name'].duplicated(keep=False)
dup_emp = emp[['first_name','team']][dup_mask]
mask_dup_emp= dup_emp.duplicated()
dup_emp[~mask_dup_emp]

    first_name            team
872      Aaron       marketing
371   Adrianne       marketing
83    Adrianne      management
142     Aluino      management
978     Ariana  data analytics
..         ...             ...
630      Wilma     engineering
257      Winny       marketing
118      Winny      management
783       Zita       marketing
476       Zita  data analytics

[96 rows x 2 columns]

In [ ]:
# counts all dropped dupliactes

In [ ]:
# drops all dupliactes

In [ ]:
# see all deleted occurrences in two columns and make permanent